app/controllers/api/albums_controller.rb

SELECT "albums".* FROM "albums"
---
  def index
    @albums = Album.all()