app/controllers/api/pictures_controller.rb

  def index
    @pictures = Picture.where(album_id: params[:album_id])
    if (params.has_key?(:numberGet))
      @pictures = @pictures.last(params[:numberGet]).reverse;
---
SELECT "pictures".* FROM "pictures"  WHERE "pictures"."album_id" = 9
SELECT  "pictures".* FROM "pictures"  WHERE "pictures"."album_id" = 7  ORDER BY "pictures"."id" DESC LIMIT 4